import { IFloorBaseData, ITableData, IRoomData } from './IInterface'
/**
 * 基础楼层的数据（包括楼和孔洞）
 */
export let floorBaseData: IFloorBaseData = {
    shape: [
        [100, 100], 
        [340, 100],
        [340, 200],
        [300, 200],
        [300, 380],
        [100, 380],
    ],
    holes: [
        [
            [120, 120],
            [160, 120],
            [160, 180],
            [120, 180]
        ],
        [
            [120, 220],
            [140, 220],
            [140, 240],
            [120, 240]
        ]
    ]
}

/**
 * 基础座位的数据
 */
export let tableData: ITableData[] = [
    {
        user: '315103',
        tableid: '6-6-201',
        shape: [
            [170, 160],
            [180, 160],
            [180, 170],
            [170, 170]
        ]
    },
    {
        user: '315104',
        tableid: '6-6-204',
        shape: [
            [190, 160],
            [200, 160],
            [200, 170],
            [190, 170]
        ]
    },
    {
        user: '315105',
        tableid: '6-6-205',
        shape: [
            [215, 155],
            [225, 166],
            [215, 175],
            [205, 165]
        ]
    }
]

export let roomData: IRoomData[] = [
    {
        roomid: '6-6-102C',
        shape: [
            [200, 200],
            [240, 200],
            [240, 240],
            [200, 240]
        ]
    },
    {
        roomid: '6-6-103C',
        shape: [
            [250, 200],
            [290, 200],
            [290, 240],
            [250, 240]
        ]
    },
    {
        roomid: '6-6-104C',
        shape: [
            [200, 300],
            [240, 300],
            [240, 310],
            [220, 310],
            [220, 320],
            [240, 340],
            [200, 340]
        ]
    }
]